XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.AC33Mx064_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>AC33Mx064_Series</name>
  <description>ABOV Semiconductor Motor Solution Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.00.0" date="2021-01-18">
            First Release version of ABOV Motor Solution Device Family Pack.
            - AC33Mx064 Series device : AC33M4064, AC33M3064
    </release>
  </releases>
  <keywords>
    <keyword>ABOV</keyword>
	  <keyword>MOTOR</keyword>
    <keyword>AC33Mx064</keyword>
    <keyword>AC33M4064</keyword>
    <keyword>AC33M3064</keyword>
  </keywords>
  <devices>
    <family Dfamily="AC33Mx064 Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV AC33Mx064 device family includes a high-performance controller, the ARM Cortex-M3 processor, and provides motor control and high-speed ADC functionality.
            </description>
      <!-- Subfamily : AC33Mx064 *********************************************************-->
      <subFamily DsubFamily="AC33Mx064">
        <processor Dclock="48000000" />
        <compile header="AC33Mx064\Core\include\AC33Mx064.h" />
        <debug svd="AC33Mx064\SVD\AC33Mx064.svd" />
        <algorithm name="AC33Mx064\Flashloader\AC33Mx064_64.FLM" start="0x00000000" size="0x10000" default="1" />
        <feature type="VCC" n="3.00" m="5.50" />
        <feature type="Temp" n="-40" m="85" />
        <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1" />
        <feature type="WDT" n="1" m="32" name="Watchdog Timer" />
        <feature type="Timer" n="6" m="16" name="Timer" />
        <feature type="PWM" n="1" m="16" name="PWM" />
        <feature type="UART" n="2" name="UART" />
        <feature type="SPI" n="1" name="SPI" />
        <feature type="I2C" n="1" name="I2C" />
        <!-- Device : AC33M4064 -->
        <device Dname="AC33M4064">
          <description>Package type 44LQFP</description>
          <feature type="IOs" n="44" name="Inputs/Outputs" />
          <feature type="QFP" n="44" name="LQFP" />
          <feature type="ADC" n="2" m="11" name="ADC" />
        </device>
        <!-- Device : AC33M3064 -->
        <device Dname="AC33M3064">
          <description>Package type 32LQFP</description>
          <feature type="IOs" n="30" name="Inputs/Outputs" />
          <feature type="QFP" n="32" name="LQFP" />
          <feature type="ADC" n="2" m="8" name="ADC" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <!-- condition : AC33M4064/3064 ********************************************************-->
    <condition id="AC33Mx064 CMSIS">
      <description>AC33M4064, AC33M3064 device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="AC33M4064" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="AC33M3064" />
    </condition>
  </conditions>
  <components>
    <!-- component : AC33M4064/3064 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>System Startup for ABOV AC33M4064/3064 devices</description>
      <files>
        <file category="include" name="AC33Mx064\Core\include\" />
        <file category="include" name="AC33Mx064\Drivers\include\" />
        <file category="header" version="1.0.0" name="AC33Mx064\Core\include\AC33Mx064.h" attr="config" />
        <file category="source" version="1.0.0" name="AC33Mx064\Core\source\ARM\startup_AC33Mx064.s" attr="config" />
        <file category="source" version="1.1.0" name="AC33Mx064\Core\source\system_AC33Mx064.c" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 debug framework</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_debug_frmwrk.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 ADC control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_adc.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="DMA" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 DMA control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_dmac.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_dmac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="GPIO" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 GPIO control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_pcu.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 I2C control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_i2c.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="MPWM" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 MPWM control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_mpwm.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_mpwm.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 PCU control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_pcu.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Power" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 Power control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_pwr.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.1.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 SCU control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_scu.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Slib" Cversion="1.1.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 SCU control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_slib.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_slib.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 SPI control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_spi.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Timer" Cversion="1.0.0" condition="AC33Mx064 CMSIS">
      <description>AC33Mx064 Timer control</description>
      <files>
        <file category="header" name="AC33Mx064\Drivers\include\AC33Mx064_hal_timer.h" />
        <file category="source" name="AC33Mx064\Drivers\source\AC33Mx064_hal_timer.c" />
      </files>
    </component>
